#include <stdio.h>

int main() {
    printf("Hello, World!\n");
    return 0;
}
/**
 * 2023-04-01
 * 正值愚人节和"哥哥怀念节"
 * 我吃完最喜欢吃的东西
 * 开始跟着翁恺老师学习C语言
 *
 * 从2018-02-28
 * 拿到Java的Mooc证书后
 * 历经济南、北京、上海的工作
 * 最高工资拿到25k
 * 由于疫情和自身发展计划
 * 或者说是在大城市的竞争
 * 已经让我感到疲倦
 * 我选择回到老家发展
 * 此时已经从开始做同学的
 * """
 * 微信平台维护
 * 再到一家小公司的美工
 * 服务器维护
 * 网页简单设计
 * 甚至简单的建模、拍摄
 * 全景VR图片制作
 * 初尝试编程语言PHP
 * 以及数据库的简单了解mariadb（前身MySQL）
 * """
 * 已经过去7年
 *
 * 虽然从2019年初
 * 才刚开始做Java（springboot）的开发
 * 但在工作过程中也已经掌握了
 * 例如rxjava2、webflux（reactor programming）、
 * oracle、pg、springcloud、grpc等技术
 * 而从一位东北程序员那里
 * 也获得了一份技术学习的分享
 * 学习了极客时间的《数据结构与算法》、《spring全家桶》、
 * 《python入门》、《某某架构设计》、《设计模式之美》
 * 等等课程，颇受益，并在其账号内买了几门课程回馈，
 * 其中也包含上面其中几门、也包含Vue相关的课程
 *
 * 当然在2019年之前，也通过有限时间里的空余时间，
 * 去看了相关编程的电子书，如《JavaScript高级程序设计》、
 * 《Java从入门到精通》、《计算机是怎样跑起来的》、
 * 《程序是怎样跑起来的》、《网络是怎样连接的》、《图解HTTP》、
 * 《Java8实战》、《Maven实战》、《SpringCloud实战》、
 * 《数学与科技》、《硅谷钢铁侠》、《硅谷之火》等相关电子书、
 * 实体书籍，颇有帮助
 *
 * 虽不能以此做为个人技术水平完全体现，也时常还会从google、
 * stackoverflow查阅技术文档，相关课程、书籍也不是历历在目
 * 但基本上算是入了编程的门路、或者是科技工种的岗位，再好听点
 * 就是转行成功
 *
 * 有时我劝我自己，放过自己，别学了，很累，但就是在一些朋友的
 * 鼓励和帮助下，包括家人的理解，才一直在这个行业走到如今。
 * 谢谢你们！
 *
 *
 *
 *
 * 2023-05-01
 * 今天是五一，是放假的节日，其实前天就已经放假了，今天去不知道
 * 怎么了，有很多好运气，可能是穿了红背心和戴了红色手环的缘故吧。
 *
 *
 *
*/